tap "homebrew/core"
tap "steipete/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Google Gemini CLI
brew "gemini-cli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Code-searching tool similar to ack
brew "the_silver_searcher"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver
brew "uv"
# Plugin manager for tmux
brew "tpm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Anthropic's official Claude AI desktop app
cask "claude"
# Anthropic Claude Code CLI
cask "claude-code"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# English dictionary
cask "eudic"
cask "font-fira-code-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-monaspice-nerd-font"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Menu bar manager
cask "jordanbaird-ice"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# MySQL/MariaDB database management tool
cask "sequel-ace"
# Snip or pin screenshots
cask "snipaste"
# System monitor for the menu bar
cask "stats"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Multiplayer code editor
cask "zed"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
